first_routes/app/controllers/artworks_controller.rb

SELECT "artworks".* FROM "artworks" WHERE "artworks"."artist_id" = $1  [["artist_id", 11]]
SELECT "artworks".* FROM "artworks"
---
    def index
        # debugger
        if params.has_key?(:user_id)
            # debugger
        # index of nested resource
            @artworks = Artwork.where(artist_id: params[:user_id])
        else
            # debugger
        # index of top-level resource
            @artworks = Artwork.all

INSERT INTO "artworks" ("title", "image_url", "artist_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "super_pink"], ["image_url", "www.pink.com"], ["artist_id", 11], ["created_at", "2021-11-11 19:22:15.337450"], ["updated_at", "2021-11-11 19:22:15.337450"]]
---
    def create
        @artwork = ArtworkShare.new(artwork_params)
        # replace the `user_attributes_here` with the actual attribute keys
        if @artwork.save

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "artworks" SET "title" = $1, "updated_at" = $2 WHERE "artworks"."id" = $3  [["title", "Sooooooooo_blue"], ["updated_at", "2021-11-11 19:25:22.072822"], ["id", 2]]
---
    def update
        @artwork = Artwork.find(params[:id])
        if @artwork.update(artwork_params)