first_routes/app/controllers/users_controller.rb

INSERT INTO "users" ("username", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["username", "banksyboo"], ["created_at", "2021-11-11 19:18:35.871884"], ["updated_at", "2021-11-11 19:18:35.871884"]]
---
    def create
        @user = User.new(user_params)
        # replace the `user_attributes_here` with the actual attribute keys
        if @user.save